Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ངས་གང་གི་ཚེ་དགེ་བའི་རྩ་བ་འདི་དག་མངོན་པར་འདུས་བྱས་ཏེ། སེམས་ཅན་རྣམས་དགེ་བའི་རྩ་བ་འདི་ལ་བཅུག་པ་དེས་ང་རབ་ཏུ་དགའ་བ་གཞལ་དུ་མེད་པ་སྐྱེས་ཏེ།
en: When I formed such roots of virtue, I also led others to such roots of virtue, and felt limitless joy in doing so.

source: དགེ་བའི་རྩ་བ་དེས་ང་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཐོབ་སྟེ།
en: Due to the roots of virtue from having done so, I achieved knowledge of the path leading to cessation as related to knowledge of what is impossible.

source: ཤེས་པ་གང་དང་ལྡན་པས་བདག་དང་སེམས་ཅན་རྣམས་ཀྱི་གནས་མ་ཡིན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་སོ་སོར་ཤེས་སོ། །
en: With such knowledge I can accurately discern, for both myself and others, the knowledge of the path that leads to cessation as related to knowledge of what is impossible.”

source: གནས་མ་ཡིན་པ་ཤེས་པ་རྒྱུར་བཅས་དང་། །དེ་བཞིན་འགོག་དང་ལམ་དང་སེམས་ཅན་གྱི། །སྤྱོད་དང་བསམ་པ་ངེས་པར་དེ་ཡི་མཐུས། །ངས་ནི་བརྟག་དང་སྤྱོད་པ་ཀུན་ཏུ་ཤེས། །
en: “By the power of knowledge of what is impossible, Including the causes, as well as ascertaining cessation, The path, and sentient beings’ actions and thoughts, I have come to know all, both concept and discernment.”

source: མཽད་གལ་གྱི་བུ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་ཡུན་རིང་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་རྟག་པར་རབ་ཏུ་དྲན་པ་ཉེ་བར་གཞག་པར་གྱུར་ཏེ།
en: “Maudgalyāyana, when I, the Thus-Gone One, was training in the practices of a bodhisattva, I always maintained utter mindfulness.

source: དྲན་པའི་དབང་པོ་གང་གིས་ང་ཤིན་ཏུ་ཉེ་བར་གནས་པས་ཡུན་རིང་པོར་བྱས་པ་དང་། ཡུན་རིང་པོར་བཤད་པ་མ་བརྗོད་དེ།
en: For a long time I dwelled by means of the faculty of mindfulness without speaking.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་འཇིགས་སྒྲོགས་བླ་མ་ཞེས་བྱ་བ་ནས་རྒྱ་ཆེར་སྦྱར་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone named Fear-Proclaiming Master; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་འཇིགས་སྒྲོགས་བླ་མ་དེའི་རིམ་གྲོ་པ། དགེ་སློང་ཡིད་དུ་འོང་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: The thus-gone Fear-Proclaiming Master had as his principal attendant a monk named Pleasant.

source: དེ་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུར་དེ་བཞིན་གཤེགས་པ་འཇིགས་སྒྲོགས་བླ་མ་དེའི་རིམ་གྲོ་པ་བྱས་ཤིང་ཡིད་དུ་འོང་སྟེ། ཡིད་དུ་མི་འོང་བ་མ་ཡིན་པས་བཤད་པ་ཡང་འཛིན་ལ། རང་གི་དོན་ཀྱང་མི་གཏོང་ངོ་། །
en: For six hundred million years he attended to the thus-gone Fear-Proclaiming Master and pleased him, never displeasing him. He memorized his teachings and never pursued his own interests.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་བསྐལ་པ་གཅིག་པོ་དེ་ལ་སངས་རྒྱས་ཁྲི་ཉིས་སྟོང་བྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱི་རིམ་གྲོ་བར་ཡང་དགེ་སློང་ཡིད་འོང་དེ་གྱུར་ཏོ། །
en: In that eon, in that buddha realm alone there were twelve thousand buddhas, and the monk Pleasant was the principal attendant to all of them.

source: དེ་ལྟར་ཕྱིས་དེ་བཞིན་གཤེགས་པ་སྟོབས་ཀྱི་ཤུགས་བརྙེས་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: At some point later there was a thus-gone one named Achiever of the Strength of Power;

source: དེའི་རིམ་གྲོ་པར་ཡང་དགེ་སློང་ཡིད་འོང་དེ་གྱུར་ཏེ།
en: the monk Pleasant was his principal attendant as well.

source: དེ་དགེ་བའི་རྩ་བ་དེས་ལྷ་དང་མི་རྣམས་སུ་སྐྱེས་སོ། །
en: By these roots of virtue he was reborn in the divine and human states.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཡིད་འོང་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the monk Pleasant was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་དགེ་སློང་ཡིད་འོང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days the monk Pleasant was me.

source: དགེ་བའི་རྩ་བ་དེས་ང་འདས་པ་ཤེས་པ་ཐོབ་ཅིང་། དྲན་པ་ཤེས་པ་དེ་ངས་སྐྱེ་བོ་མང་པོ་ཡང་དག་པར་འཛིན་དུ་བཅུག་ཅིང་།
en: Due to those roots of virtue I achieved knowledge of the past, and also led many beings to take up knowledge of mindfulness. Moreover,

source: གཞན་དག་གི་དགེ་བའི་རྩ་བ་ལ་ཡང་ཡིད་དགའ་བས་རྗེས་སུ་ཡི་རངས་ཏེ་དགེ་བའི་རྩ་བ་དེས་ང་འདས་པའི་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བརྙེས་སོ། །
en: I happily rejoiced in others’ roots of virtue, and the roots of virtue from doing so led me to achieve knowledge of the origin as related to knowledge of the past.

source: དགེ་བའི་རྩ་བ་དེ་དང་ཤེས་པ་དེ་ཡང་ཤེས་པ་གང་གིས་ཡོངས་སུ་བསྔོས་པའི་དགེ་བའི་རྩ་བ་དེས། འདས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱས།
en: I dedicated those roots of virtue and that knowledge by the very same knowledge, and due to the roots of virtue from having done so, actualized knowledge of cessation as related to knowledge of the past.

source: ཐབས་གང་གིས་ང་སྤྱད་པ་སྤྱོད་པ་ན། དེ་སྐྱེ་བོའི་ཚོགས་མང་པོ་ཤེས་པ་དེ་ལ་རབ་ཏུ་བཀོད་དེ།
en: Whatever methods I applied in practice, I inspired multitudes of beings toward knowledge of them.

source: དགེ་བའི་རྩ་བ་དེས་ང་འདས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བརྙེས་སོ། །
en: Due to the roots of virtue from having done so, I gained knowledge of the path leading to cessation as related to knowledge of the past.”

source: མཽད་གལ་གྱི་བུ་ང་མ་འོངས་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དཀའ་བ་མང་པོ་བྱས་ཏེ། གཏང་བར་དཀའ་བ་བཏང་ནས་ཇི་ལྟར་མ་འོངས་པའི་དུས་ན། བདག་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བར་གྱུར་ཅིག་སྙམ་མོ། །
en: “Maudgalyāyana, in the past when I was training as a bodhisattva, I underwent many hardships in order to understand the future. While doing so, I thought, ‘By facing these hardships may I in the future gain insight into unobscured wisdom.’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་འཁོར་བ་དཔག་ཏུ་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གསལ་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone one named Luminous Wisdom Lamp.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གསལ་བའི་སྒྲོན་མ་དེའི་འཁོར་ཉན་ཐོས་འབུམ་བྱུང་ངོ་། །
en: The thus-gone Luminous Wisdom Lamp had a following of one hundred thousand hearers.

source: དེ་མ་འོངས་པའི་དུས་ལས་བརྩམས་ནས་ཉན་ཐོས་རྣམས་ལ་ཆོས་སྟོན་པ་དེའི་ཚེ། དགེ་སློང་རྟག་ཏུ་བརྩོན་འགྲུས་རྩོམ་པ་ཞེས་བྱ་བ་དེའི་འཁོར་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Once when he was teaching his hearers on the topic of the future there was in the audience a monk named Always Diligent, who thought to himself,

source: ཀྱེ་ཨེ་མ་བདག་མ་འོངས་པའི་དུས་ན་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་དང་ལྡན་པར་གྱུར་ཅིག་སྙམ་ནས།
en: ‘How amazing! In the future may I attain insight into unobscured wisdom!’

source: དེ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གསལ་བའི་སྒྲོན་མ་དེ་ལ་གསེར་གྱི་མེ་ཏོག་ཆེན་པོ་མངོན་པར་གཏོར་ཏེ་སྨོན་ལམ་བཏབ་པ།
en: With that thought in mind he tossed a large golden flower toward the thus-gone Luminous Wisdom Lamp, and made a prayer:

source: ཀྱེ་ཨེ་མ་བདག་མ་འོངས་པའི་དུས་ན་འདི་ལྟ་བུའི་ཡེ་ཤེས་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ
en: ‘How amazing—in the future may this wisdom dawn in me!’

source: དགེ་བའི་རྩ་བ་དེས་ང་མ་འོངས་པ་ཤེས་པ་བརྙེས་སོ། །
en: Due to that root of virtue I achieved knowledge of the future.

source: དགེ་བའི་རྩ་བ་དེས་ཀྱང་ང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་མཁྱེན་ཏེ།
en: Also due to that root of virtue I came to understand dependent origination. Furthermore,

source: དགེ་བའི་རྩ་བ་དེས་ང་མ་འོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་བརྙེས་སོ། །
en: due to that root of virtue I achieved knowledge of the origin as related to knowledge of the future.

source: རྒྱུ་དང་རྐྱེན་གང་ཞིག་ཡོད་ན་མ་འོངས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་ཀྱི། དེའི་རྒྱུ་མེད་ན་དེ་ལྟ་བུ་རབ་ཏུ་ཤེས་པར་མི་འགྱུར་ཏེ།
en: In general, if the causes and conditions are present, one will accomplish knowledge of the origin as related to knowledge of the future, while such understanding will not come about if those causes are absent.

source: དགེ་བའི་རྩ་བ་དེས་ང་མ་འོངས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱས་སོ། །
en: Due to such roots of virtue, I achieved knowledge of cessation as related to knowledge of the future.

source: ང་མཆོག་ཏུ་དགའ་བ་གང་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ལ་བསྟན་ཏེ། ཤེས་པ་དེ་མངོན་པར་དགའ་ཞིང་ཡོངས་སུ་དག་པའི་ཚུལ་ཁྲིམས་ཀྱི་དགེ་བའི་རྩ་བས་ང་མ་འོངས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་བརྙེས་སོ། །
en: With great delight I taught the bodhisattva great beings, and due to the roots of virtue from such gladness and utterly pure discipline, I achieved knowledge of the path leading to cessation as related to knowledge of the future.”

source: མཽད་གལ་གྱི་བུ་གཞན་ཡང་ད་ལྟར་བྱུང་བའི་ཤེས་པ་བསྒྲུབ་པའི་དོན་དུ་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Furthermore, Maudgalyāyana, I also created numerous roots of virtue in order to achieve knowledge of the present.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པའི་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཐའ་ཡས་སྤྱན་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Long ago in limitless cyclic existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone, worthy, perfect buddha named Limitless Sight; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་པ་ལ། ད་ལྟར་བྱུང་བའི་དུས་ལས་བརྩམས་ཏེ་ཆོས་སྟོན་ཏོ། །
en: Once he was teaching on the topic of the present while surrounded and revered by a retinue numbering into the hundreds of thousands. Among those present at the time was a brahmin named Buddhimat, who was similar to a great sal tree.

source: དེའི་ཚེ་བྲམ་ཟེ་བློ་ལྡན་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་ཞིག་ཀྱང་དེའི་འཁོར་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱི་སྤོབས་པ་ཐོགས་པ་མེད་པས་ད་ལྟར་གྱི་དུས་ལས་བརྩམས་ནས་ཆོས་སྟོན་པ་བྲམ་ཟེ་བློ་ལྡན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་ཐོས་སོ། །
en: The brahmin Buddhimat, who was similar to a great sal tree, heard the Blessed One teach the Dharma with unlimited eloquence on the topic of the present.

source: ཐོས་ནས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེའི་དྲུང་ནས་ངོ་མཚར་དུ་བྱ་བ་གཞལ་དུ་མེད་པ་ཞིག་སྐྱེས་པར་གྱུར་ཏེ། འདི་ལྟར་དེ་བཞིན་གཤེགས་པས་ད་ལྟར་བྱུང་བའི་དུས་ལས་བརྩམས་ནས་སྤོབས་པ་ཐོགས་པ་མེད་པས་ཆོས་སྟོན་པ་འདི་ནི་ངོ་མཚར་ཏོ། །
en: Moreover, upon hearing it he felt unfathomable wonder at being in the Thus-Gone One’s presence, and thought to himself, ‘It is amazing how the Thus-Gone One teaches the Dharma with such unhindered eloquence on the topic of the present.

source: འདི་ནི་རྨད་དུ་བྱུང་བའོ་སྙམ་མོ། །
en: How marvelous!’

source: དེ་དེ་བཞིན་གཤེགས་པའི་དྲུང་ནས་ངོ་མཚར་དུ་བྱ་བ་ཐོབ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་རིན་པོ་ཆེའི་མེ་ཏོག་གཏོར་ཏེ་སྨོན་ལམ་བཏབ་པ།
en: Feeling such wonder to be in the Thus-Gone One’s presence, he tossed a flower made of a precious substance toward the Thus-Gone One and made a prayer:

source: ཀྱེ་ཨེ་མ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སྤོབས་པ་ཐོགས་པ་མེད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ
en: ‘How amazing! May I fully awaken to unsurpassed and perfect buddhahood, and thereby teach the Dharma to achieve such unhindered eloquence!’

source: དེ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུར་ལོག་པར་ལྟུང་བར་མ་སོང་ངོ་། །
en: Due to the ripening of that action, he did not fall into degeneration for eight hundred million eons.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་བློ་ལྡན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་བལྟ་བར་མི་བྱ་སྟེ
en: Maudgalyāyana, in case you may think that at that time the householder of the brahmin caste named Buddhimat, who was similar to a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་བློ་ལྡན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days the householder of the brahmin caste name Buddhimat, similar to a great sal tree, was me.

source: དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བྱུང་བའི་དུས་ན་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་སྐྱེས་ཏེ།
en: Due to that root of virtue I developed unhindered wisdom with regard to the present.

source: ངས་ད་ལྟར་བྱུང་བའི་ཤེས་པ་དེ་ལ་སྐྱེ་བོའི་ཚོགས་མང་པོ་བཙུད་དོ། །
en: I also inspired many beings toward knowledge of the present,

source: དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བྱུང་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་མངོན་པར་གྲུབ་སྟེ།
en: thereby creating roots of virtue that led me to accomplish knowledge of the origin as related to knowledge of the present.

source: ད་ལྟར་བྱུང་བའི་ཤེས་པ་དེ་ཡང་ངས་མངོན་སུམ་དུ་བྱས་ཤིང་ཡང་དག་པར་རབ་ཏུ་བསྟན་པས་སྐྱེ་བོའི་ཚོགས་མང་པོ་དག་གིས་ཀྱང་མངོན་སུམ་དུ་བྱས་སོ། །
en: Moreover, I actualized knowledge of the present and then taught it genuinely, so that many other beings actualized it as well.

source: དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Due to the roots of virtue that came from that, I actualized the knowledge of cessation as related to knowledge of the present.

source: ལམ་གང་གིས་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་མངོན་སུམ་དུ་བྱས་པ་དེ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ལ་བསྙེན་བཀུར་བྱས་ཤིང་ཡོངས་སུ་ཞུས་སོ། །
en: “In order to actualize the path that leads to cessation as related to knowledge of the present, when I was training as a bodhisattva, I served and asked questions to trillions of buddhas.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཐའ་ཡས་གཟིགས་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone, worthy, perfect buddha named Limitless Vision; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐེར་འབུམ་ཕྲག་བདུན་བྱུང་ངོ་། །
en: The thus-gone Limitless Vision had a community of seven billion hearers.

source: དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དེའི་ནང་དུ་བཞུགས་ནས་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལས་བརྩམས་ཏེ། ལམ་འདིས་ད་ལྟར་བྱུང་བའི་ཚུལ་ཡོངས་སུ་ཤེས་པར་བྱའོ་ཞེས་ཆོས་སྟོན་ཏོ། །
en: Once, in the midst of his community of hearers, he was teaching the Dharma on the topic of the path that leads to cessation as related to knowledge of the present, explaining, ‘You should understand how the present is through this path . . . .’

source: དེའི་ཚེ་རྒྱལ་རིགས་ས་གའི་བཤེས་གཉེན་ཞེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེའི་འཁོར་ཉིད་དུ་འདུས་ཏེ་འདུག་པར་གྱུར་ནས། དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “In the audience at that time was a man of the warrior caste, who was like a great sal tree, named Viśākhamitra, who addressed the blessed thus-gone Limitless Vision, saying,

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱུང་བ་མཁྱེན་པ་འགོག་པར་འགྱུར་བའི་ལམ་ལས་བརྩམས་ནས་གང་འདི་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་སྣ་ཚོགས་དང་། ཉོན་མོངས་པ་སྣ་ཚོགས་དག་སྤྱོད་པ་ལ་ལམ་གྱི་ཁྱད་པར་གྱི་ཆོས་སྟོན་པ་ཐོས་པར་འཚལ་ལོ། །
en: ‘Please, O Blessed One, I request to hear a Dharma teaching by the Blessed One particularly on the path—the path that leads to cessation as related to knowledge of the present, which treats the various intentions and afflictions that sentient beings are involved with.’

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་དེས་རྒྱལ་རིགས་ས་གའི་བཤེས་གཉེན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “The blessed thus-gone Limitless Vision replied to Viśākhamitra of the warrior caste, who was like a great sal tree,

source: ས་གའི་བཤེས་གཉེན་ཁྱོད་འདི་ལྟར་ཡུན་རིང་པོར་ཆོས་ཟབ་མོ་སྤྱད་ཟབ་མོའི་ཚུལ་ལ་རབ་ཏུ་གནས་ཤིང་སྔོན་གྱི་སངས་རྒྱས་ལ་བསྙེན་བཀུར་བྱས་ཏེ།
en: ‘Viśākhamitra, for a long time you have been immersed in the profound Dharma and the way of profound practice, and serving the buddhas of the past.

source: སྐྱེ་བོའི་ཚོགས་མང་པོའི་དོན་དུ་བསམས་ནས། ཟབ་མོ་དེ་དག་ཞུ་བ་ཞུས་པ་དེ་ལེགས་སོ་ལེགས་སོ། །
en: It is excellent that you have asked about these profound points with the intention to help numerous beings, excellent indeed.

source: ས་གའི་བཤེས་གཉེན་དེའི་ཕྱིར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: Listen well then, Viśākhamitra, and keep what I am about to say in your heart.’

source: རྒྱལ་རིགས་ས་གའི་བཤེས་གཉེན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: Viśākhamitra of the warrior caste, who was like a great sal tree, replied to the Blessed One, ‘Of course, of course!’ and he listened attentively as the Blessed One had directed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “The Blessed One continued,

source: ས་གའི་བཤེས་གཉེན་སེམས་ཅན་དག་གཟུགས་ལ་འདོད་ཆགས་སྤྱོད་པའི་གཉེན་པོ་ནི་མི་གཙང་བའོ། །
en: ‘Viśākhamitra, the remedy for sentient beings involved in desire toward the physical form is uncleanliness.

source: སེམས་ཅན་དག་སྒྲ་ལ་འདོད་ཆགས་སྤྱོད་པའི་གཉེན་པོ་ནི་མི་རྟག་པའི་འདུ་ཤེས་སོ། །
en: The remedy for sentient beings involved in desire toward sounds is the principle of impermanence.

source: དེ་བཞིན་དུ་སེམས་ཅན་དག་དྲི་ལ་འདོད་ཆགས་སྤྱོད་པའི་གཉེན་པོ་ནི་སྟོང་པ་ཉིད་དོ། །
en: The remedy for sentient beings involved in desire toward scents is emptiness.

source: སེམས་ཅན་དག་རོ་ལ་འདོད་ཆགས་སྤྱོད་པའི་གཉེན་པོ་ནི་མི་འཐུན་པའི་འདུ་ཤེས་སོ། །
en: The remedy for sentient beings involved in desire toward tastes is the idea of the unpleasant.

source: སེམས་ཅན་དག་རེག་བྱ་ལ་འདོད་ཆགས་སྤྱོད་པའི་གཉེན་པོ་ནི་སྡུག་བསྔལ་བའི་འདུ་ཤེས་སོ། །
en: The remedy for sentient beings involved in desire toward textures is the idea of suffering.

source: སེམས་ཅན་དག་ཆོས་ལ་འདོད་ཆགས་སྤྱོད་པའི་གཉེན་པོ་ནི་བདག་མེད་པའི་འདུ་ཤེས་སོ། །
en: The remedy for sentient beings involved in desire toward objects of thought is the absence of identity.

source: ས་གའི་བཤེས་གཉེན་ཚུལ་འདིས་ནི་སེམས་ཅན་དག་ཇི་ལྟར་སྤྱོད་པའི་གཉེན་པོ་བསྟན་པར་བྱ་སྟེ།
en: Viśākhamitra, here I have explained the remedies for beings no matter what they are involved with.

source: ས་གའི་བཤེས་གཉེན་གཞན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལམ་ཡོད་ཅིང་ལམ་གྱི་སྤྱོད་པ་ཡོད་དེ་འདི་ལྟ་སྟེ་ཐེ་ཚོམ་མེད་པའི་སྨན་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་སོ། །
en: Furthermore, Viśākhamitra, there is a path, and practice related to that path, that applies to all sentient beings, an indisputable medicine: that is to perceive all worlds with aversion.

source: ས་གའི་བཤེས་གཉེན་གཞན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཐེ་ཚོམ་མེད་པར་ལམ་གང་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལམ་གྱི་མཆོག་ལ་ལམ་གང་གིས་ཡང་དག་པར་སྤོང་བ་འདི་ལྟ་སྟེ། རྣམ་པར་ཐར་བའི་སྒོ་མཚན་མ་མེད་པའོ། །
en: Viśākhamitra, the path on which all sentient beings have an indisputable practice, the foremost path of practice for all sentient beings, the path that leads to right abandonment, is the gateway to the liberation of absence of marks.

source: ས་གའི་བཤེས་གཉེན་འདི་ལྟ་སྟེ། མཚན་མ་ཐམས་ཅད་ཡིད་ལ་མི་བྱེད་པ་འདི་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཐེ་ཙོམ་མེད་པའི་ལམ་འཆིང་བ་ཐམས་ཅད་ཡང་དག་པར་གཅོད་པར་འགྱུར་རོ། །
en: Viśākhamitra, not mentally engaging with any marks is the path of indisputable practice for all sentient beings; it cuts away all fetters.

source: ས་གའི་བཤེས་གཉེན་ངས་ཤེས་པ་འདི་བསྒྲུབ་པའི་ཕྱིར། སྔོན་གྱི་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དག་ལ་བསྙེན་བཀུར་བྱས་ཏེ།
en: Viśākhamitra, in order to achieve this knowledge, I served trillions of buddhas in the past.

source: དེ་ལྟར་ངས་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་དགེ་བའི་རྩ་བ་དེ་དག་གིས་ངས་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་བསྒྲུབས་སོ། །
en: In doing so, I created roots of virtue, and due to those roots of virtue I achieved knowledge of the path that leads to cessation as related to knowledge of the present.’

source: མཽད་གལ་གྱི་བུ་དེ་ནས་རྒྱལ་རིགས་ས་གའི་བཤེས་གཉེན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཟིགས་དེ་ལ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་མེ་ཏོག་གིས་མངོན་པར་གཏོར། མངོན་པར་རབ་ཏུ་གཏོར་ནས་ལུས་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་ཕྱག་འཚལ་ལོ། །
en: “Maudgalyāyana, then Viśākhamitra of the warrior caste, who was like a great sal tree, tossed and scattered flowers made of every precious substance toward the blessed thus-gone Limitless Vision, and then prostrated his entire body to the Blessed One.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་རིགས་ས་གའི་བཤེས་གཉེན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: Maudgalyāyana, in case you may think that at that time Viśākhamitra of the warrior caste, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་རིགས་ས་གའི་བཤེས་གཉེན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days Viśākhamitra of the warrior caste, who was like a great sal tree, was me.

source: དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བྱུང་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་མངོན་པར་ཡང་དག་པར་ཐུགས་སུ་ཆུད་དོ། །
en: Due to those roots of virtue, I truly realized the knowledge of the path that leads to cessation as related to knowledge of the present.”

source: རྒྱལ་བ་ཀུན་གཟིགས་སྐྱོབ་ལ་བཀུར་སྟི་བྱས་པས་སུ། །དགེ་རྩ་དེ་ཡིས་ད་ལྟར་བྱུང་ཤེས་ང་རྣམ་སྦྱངས། །
en: “Due to the roots of virtue from serving the victorious savior Who had vision of all, I perfected my knowledge of the present.

source: དེ་འདྲའི་དགེ་རྩ་མེད་ན་ཀུན་མཐོང་མི་ནུས་ཏེ། །
en: Without those roots of virtue, I would never have seen everything.

source: དགེ་རྩ་གང་གིས་ད་ལྟར་བྱུང་ཤེས་ང་རྣམ་སྦྱངས། །
en: Due to these roots of virtue, I perfected my knowledge of the present.

source: ང་ནི་ཆོས་གང་མི་ཤེས་ཅི་ཡང་མེད་པས་ན། །བདུད་ཀྱི་ཞགས་པའི་རྒྱུད་ལས་སེམས་ཅན་ཐར་བར་བྱ། །
en: Since there is nothing that I do not know, I will free sentient beings’ minds from the fetters of Māra.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་དྲི་བའི་རང་བཞིན་ཅན་དུ་བྱ་སྟེ།
en: “Therefore, Maudgalyāyana, bodhisattvas ought to have an inquisitive disposition.

source: མཽད་གལ་གྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་འདྲི་བའི་རང་བཞིན་ཅན་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: Maudgalyāyana, bodhisattvas with an inquisitive disposition swiftly and completely awaken to unsurpassed and perfect buddhahood.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པའི་འཁོར་བ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་ཁྲིད་མཛད་ཅེས་བྱ་བ་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, in the distant past there appeared in the world a thus-gone one named Instructor; he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་འདི་ཞེང་དུ་དཔག་ཚད་དྲུག་ཁྲིར་གྱུར་ཅིང་། ཀུན་ནས་གྲུ་བཞི་ལ་ཇི་ཙམ་དུ་སྲིད་དུ་ཡོད་པ་དེ་ཙམ་དུ་ཞེང་དུ་ཡང་གྲུ་བཞི་སྟེ།
en: In his time, this world was sixty thousand leagues wide and perfectly square—it was exactly as wide as it was long.

source: འདི་ལྟ་སྟེ་མཛེས་པར་སྤྲུལ་པ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་མིག་མངས་རིས་སུ་བྲིས་པ། གསེར་གྱི་གདུགས་ཀྱིས་ཤིན་ཏུ་བཀབ་པ། ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་ཏོ། །
en: It was decorated with a beautifully emanated and extremely ornate checker design, covered entirely by a golden parasol, and entirely flat like the palm of a hand.

source: དེའི་ཚེ་ང་འཛམ་བུའི་གླིང་གི་རྒྱལ་པོར་གྱུར་ཏེ། ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་རྒྱལ་བའི་སྡེ་ཞེས་བྱའོ། །
en: In those times I was the king of the world, a devout Dharma king named Jayasena

source: དེའི་བུ་སྟོང་ཚང་བར་བྱུང་སྟེ།
en: who had one thousand children.

source: དེའི་བུ་ཐུ་བོ་གཞོན་ནུ་ཞི་བའི་བློ་གྲོས་ཞེས་བྱ་བ་སངས་རྒྱས་དཔག་ཏུ་མེད་པ་ལ་བསྙེན་བཀུར་བྱས་པ།
en: The eldest of these, named Prince Śāntamati, had served innumerable buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་ལ་འདྲིས་པར་བྱས་པ་སྟོང་པ་ཉིད་ལ་མོས་པ།
en: He was familiar with all the teachings of bodhisattvas and was dedicated to emptiness.

source: ཆོས་ཟབ་མོའི་བཟོད་པ་དང་ལྡན་པ་རྒྱ་ཆེན་པོ་ལ་མོས་ཤིང་།
en: He was accepting of the profound teachings and dedicated to the vast.

source: ཆོས་དམན་པ་ལ་མ་མོས་ཏེཆོས་དམན་པ་ལ་རྣམ་པར་སྨོད་པ།
en: He did not dedicate himself to the lower teachings, and on the contrary disparaged them.

source: བློ་གྲོས་ཤིན་ཏུ་ཞིབ་པ་ཞིག་བྱུང་ངོ་། །
en: His intellect was extremely refined.

source: དེ་ནས་རྒྱལ་པོ་རྒྱལ་བའི་སྡེ་འདི་སྙམ་དུ་གྱུར་ཏེ།
en: “One day King Jayasena had the thought,
